# ðŸš²Bike rental data management

A database to help analysts of a bike rental company understand the effects of weather on bike rentals. 

### Input: 
- Year of bike rental data from the company 
- Weather data from the government. 

### Output:
- Clean and validate both data sets
- Design a relational PostgreSQL database to store the data
- Develop views for the database to assist the analytics team.

### Steps

- Prepare the Data
- Create a Schema
- Create the Database
- Create Views
- Create a Write-up

In [1]:
#|export

import seaborn as sns
import pandas as pd
from matplotlib import pyplot as plt
import glob
import sqlalchemy as sql
import psycopg2

In [2]:
#|export

import warnings

# Ð—Ð°Ñ€Ð°Ð½ÐµÐµ Ð¾Ñ‚ÐºÐ»ÑŽÑ‡Ð¸Ð¼ Ð²Ð¾Ñ€Ð½Ð¸Ð½Ð³Ð¸
warnings.filterwarnings("ignore") # Ð—Ð°Ñ€Ð°Ð½ÐµÐµ ÑƒÐ±ÐµÑ€ÐµÐ¼ Ð²Ð¾Ñ€Ð½Ð¸Ð½Ð³Ð¸

## Pre-processing

- data import
- data cleaning

### Steps for data import & cleaning:

- Load and concatenate data
- Review the data (.head())
- Inspect for missing and suspicious data (.describe(), .info(), .isna(), .sum())
- Address any data quality issues (replacing or flagging missing or suspicious values, fixing typos, or repairing any joins that didnâ€™t work as expected).
- Are there any new columns you could create that they might expect?

## JC-files

In [3]:
#|export

jc_files = glob.glob(r'..\bike_rental_data\data\JC-2016**-citibike-tripdata.csv')
jc_files

['..\\bike_rental_data\\data\\JC-201601-citibike-tripdata.csv',
 '..\\bike_rental_data\\data\\JC-201602-citibike-tripdata.csv',
 '..\\bike_rental_data\\data\\JC-201603-citibike-tripdata.csv',
 '..\\bike_rental_data\\data\\JC-201604-citibike-tripdata.csv',
 '..\\bike_rental_data\\data\\JC-201605-citibike-tripdata.csv',
 '..\\bike_rental_data\\data\\JC-201606-citibike-tripdata.csv',
 '..\\bike_rental_data\\data\\JC-201607-citibike-tripdata.csv',
 '..\\bike_rental_data\\data\\JC-201608-citibike-tripdata.csv',
 '..\\bike_rental_data\\data\\JC-201609-citibike-tripdata.csv',
 '..\\bike_rental_data\\data\\JC-201610-citibike-tripdata.csv',
 '..\\bike_rental_data\\data\\JC-201611-citibike-tripdata.csv',
 '..\\bike_rental_data\\data\\JC-201612-citibike-tripdata.csv']

In [4]:
#|export

#Citi Bike data from Jersey City

df_jc = []

In [5]:
#|export

for file in jc_files:
    df_jc.append(pd.read_csv(file))

df_jc = pd.concat(df_jc).reset_index(drop=True)

In [6]:
#|export

df_jc.columns = df_jc.columns.str.lower()
df_jc.columns = df_jc.columns.str.replace(' ', '_')

In [7]:
#|export

# Print head of datasets for the 12 months of 2016 united

print('Initial data head:')
print()

df_jc.head(5)

Initial data head:

,trip_duration,start_time,stop_time,start_station_id,start_station_name,start_station_latitude,start_station_longitude,end_station_id,end_station_name,end_station_latitude,end_station_longitude,bike_id,user_type,birth_year,gender
0,362,2016-01-01 00:02:52,2016-01-01 00:08:54,3186,Grove St PATH,40.719586,-74.043117,3209,Brunswick St,40.724176,-74.050656,24647,Subscriber,1964.0,2
1,200,2016-01-01 00:18:22,2016-01-01 00:21:42,3186,Grove St PATH,40.719586,-74.043117,3213,Van Vorst Park,40.718489,-74.047727,24605,Subscriber,1962.0,1
2,202,2016-01-01 00:18:25,2016-01-01 00:21:47,3186,Grove St PATH,40.719586,-74.043117,3213,Van Vorst Park,40.718489,-74.047727,24689,Subscriber,1962.0,2
3,248,2016-01-01 00:23:13,2016-01-01 00:27:21,3209,Brunswick St,40.724176,-74.050656,3203,Hamilton Park,40.727596,-74.044247,24693,Subscriber,1984.0,1
4,903,2016-01-01 01:03:20,2016-01-01 01:18:24,3195,Sip Ave,40.730743,-74.063784,3210,Pershing Field,40.742677,-74.051789,24573,Customer,NaN,0

In [8]:
#|export

df_jc.describe()

,trip_duration,start_station_id,start_station_latitude,start_station_longitude,end_station_id,end_station_latitude,end_station_longitude,bike_id,birth_year,gender
count,2.475840e+05,247584.000000,247584.000000,247584.000000,247584.000000,247584.000000,247584.000000,247584.000000,228585.000000,247584.000000
mean,8.856305e+02,3207.065206,40.723121,-74.046438,3203.572553,40.722594,-74.045855,24935.260481,1979.335276,1.123534
std,3.593798e+04,26.955103,0.008199,0.011211,61.579494,0.007958,0.011283,748.469712,9.596809,0.518687
min,6.100000e+01,3183.000000,40.692640,-74.096937,147.000000,40.692216,-74.096937,14552.000000,1900.000000,0.000000
25%,2.480000e+02,3186.000000,40.717732,-74.050656,3186.000000,40.716540,-74.050444,24491.000000,1974.000000,1.000000
50%,3.900000e+02,3201.000000,40.721525,-74.044247,3199.000000,40.721124,-74.043117,24609.000000,1981.000000,1.000000
75%,6.660000e+02,3211.000000,40.727596,-74.038051,3211.000000,40.727224,-74.036486,24719.000000,1986.000000,1.000000
max,1.632981e+07,3426.000000,40.752559,-74.032108,3426.000000,40.801343,-73.957390,27274.000000,2000.000000,2.000000

In [9]:
#|export

df_jc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 247584 entries, 0 to 247583
Data columns (total 15 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   trip_duration            247584 non-null  int64
 1   start_time               247584 non-null  object
 2   stop_time                247584 non-null  object
 3   start_station_id         247584 non-null  int64
 4   start_station_name       247584 non-null  object
 5   start_station_latitude   247584 non-null  float64
 6   start_station_longitude  247584 non-null  float64
 7   end_station_id           247584 non-null  int64
 8   end_station_name         247584 non-null  object
 9   end_station_latitude     247584 non-null  float64
 10  end_station_longitude    247584 non-null  float64
 11  bike_id                  247584 non-null  int64
 12  user_type                247204 non-null  object
 13  birth_year               228585 non-null  float64
 14  gender                   247584 non-null  int64
dtypes: float64(5), int64(5), object(5)
memory usage: 28.3+ MB

In [10]:
#|export

# None check

(
    df_jc.isna()
    .sum()
    .sort_values(ascending=False)
)

birth_year                 18999
user_type                    380
trip_duration                  0
start_time                     0
stop_time                      0
start_station_id               0
start_station_name             0
start_station_latitude         0
start_station_longitude        0
end_station_id                 0
end_station_name               0
end_station_latitude           0
end_station_longitude          0
bike_id                        0
gender                         0
dtype: int64

In [11]:
print('Max percent of NANs in column:', str(round(df_jc['birth_year'].isna().sum() / len(df_jc) * 100, 2)) + '%')

Max percent of NANs in column: 7.67%

## Newark-files

In [12]:
df_na = pd.read_csv('../bike_rental_data/data/newark_airport_2016.csv')

In [13]:
#|export

df_na.columns = df_na.columns.str.lower()
df_na.columns = df_na.columns.str.replace(' ', '_')

In [14]:
#|export

# Print head of weather dataset

print('Initial data head:')
print()
df_na.head(5)

Initial data head:

,station,name,date,awnd,pgtm,prcp,snow,snwd,tavg,tmax,tmin,tsun,wdf2,wdf5,wsf2,wsf5
0,USW00014734,"NEWARK LIBERTY INTERNATIONAL AIRPORT, NJ US",2016-01-01,12.75,NaN,0.0,0.0,0.0,41,43,34,NaN,270,280.0,25.9,35.1
1,USW00014734,"NEWARK LIBERTY INTERNATIONAL AIRPORT, NJ US",2016-01-02,9.40,NaN,0.0,0.0,0.0,36,42,30,NaN,260,260.0,21.0,25.1
2,USW00014734,"NEWARK LIBERTY INTERNATIONAL AIRPORT, NJ US",2016-01-03,10.29,NaN,0.0,0.0,0.0,37,47,28,NaN,270,250.0,23.9,30.0
3,USW00014734,"NEWARK LIBERTY INTERNATIONAL AIRPORT, NJ US",2016-01-04,17.22,NaN,0.0,0.0,0.0,32,35,14,NaN,330,330.0,25.9,33.1
4,USW00014734,"NEWARK LIBERTY INTERNATIONAL AIRPORT, NJ US",2016-01-05,9.84,NaN,0.0,0.0,0.0,19,31,10,NaN,360,350.0,25.1,31.1

In [15]:
#|export

df_na.describe()

,awnd,pgtm,prcp,snow,snwd,tavg,tmax,tmin,tsun,wdf2,wdf5,wsf2,wsf5
count,366.000000,0.0,366.000000,366.000000,366.000000,366.000000,366.000000,366.000000,0.0,366.000000,364.000000,366.000000,364.000000
mean,9.429973,NaN,0.104945,0.098087,0.342623,57.196721,65.991803,48.459016,NaN,217.841530,228.269231,20.484426,26.801648
std,3.748174,NaN,0.307496,1.276498,2.078510,17.466981,18.606301,17.135790,NaN,102.548282,97.415777,6.848390,8.882610
min,2.460000,NaN,0.000000,0.000000,0.000000,8.000000,18.000000,0.000000,NaN,10.000000,10.000000,6.900000,10.100000
25%,6.765000,NaN,0.000000,0.000000,0.000000,43.000000,51.250000,35.000000,NaN,150.000000,150.000000,15.000000,19.900000
50%,8.720000,NaN,0.000000,0.000000,0.000000,56.000000,66.000000,47.000000,NaN,240.000000,260.000000,19.900000,25.100000
75%,11.410000,NaN,0.030000,0.000000,0.000000,74.000000,83.000000,64.000000,NaN,300.000000,300.000000,23.900000,31.100000
max,22.820000,NaN,2.790000,24.000000,20.100000,89.000000,99.000000,80.000000,NaN,360.000000,360.000000,48.100000,66.000000

In [16]:
#|export

df_na.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 366 entries, 0 to 365
Data columns (total 16 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   station  366 non-null    object
 1   name     366 non-null    object
 2   date     366 non-null    object
 3   awnd     366 non-null    float64
 4   pgtm     0 non-null      float64
 5   prcp     366 non-null    float64
 6   snow     366 non-null    float64
 7   snwd     366 non-null    float64
 8   tavg     366 non-null    int64
 9   tmax     366 non-null    int64
 10  tmin     366 non-null    int64
 11  tsun     0 non-null      float64
 12  wdf2     366 non-null    int64
 13  wdf5     364 non-null    float64
 14  wsf2     366 non-null    float64
 15  wsf5     364 non-null    float64
dtypes: float64(9), int64(4), object(3)
memory usage: 45.9+ KB

In [17]:
#|export

# None check

(
    df_na.isna()
    .sum()
    .sort_values(ascending=False)
)

pgtm       366
tsun       366
wdf5         2
wsf5         2
station      0
name         0
date         0
awnd         0
prcp         0
snow         0
snwd         0
tavg         0
tmax         0
tmin         0
wdf2         0
wsf2         0
dtype: int64

## Pre-processing Summary

### JC-files

- Some colums has wrong data-type (start/stop_time, birth_year). It's better change that.
- We got some strange NAN's in birth_year column. Better fill it with zeros.
- We need to split table and extract 'start_station' and 'end_station' tables.

### Newark-files

- Two columns almost consist of NANs (pgsm, tsun) and we'll drop them.
- Change data type of wdf5 to integer and .fillna() for wdf5 and wsf5
- We need to split table and extract 'station'

## Create a Schema

- Split data into relational tables (like different components of a trip, like stations)
- Updating, inserting, and deleting data (same data could stored in multiple tables or rows)
- Review columns of each table (check data types)
- Review primary key, foreign key relationships

In [18]:
 # Filling nan values and chnging data types

df_jc['birth_year'] = df_jc['birth_year'].fillna(0)
df_jc['birth_year'] = df_jc['birth_year'].astype('Int32')

df_jc['start_time'] = pd.to_datetime(df_jc['start_time'])
df_jc['stop_time'] = pd.to_datetime(df_jc['stop_time'])

In [19]:
# Spliting tables

df_jc_ride = df_jc.drop(columns=['start_station_name', 'start_station_latitude', 'start_station_longitude', \
                                 'end_station_name', 'end_station_latitude', 'end_station_longitude'])\
                                    .rename(columns={'start_station_id':'foreign_start_station_id','end_station_id':'foreign_end_station_id'})
df_start_station = df_jc[['start_station_id', 'start_station_name', 'start_station_latitude', 'start_station_longitude']].drop_duplicates().reset_index(drop=True)
df_end_station = df_jc[['end_station_id', 'end_station_name', 'end_station_latitude', 'end_station_longitude']].drop_duplicates().reset_index(drop=True)

In [20]:
df_jc_ride.head(5)

,trip_duration,start_time,stop_time,foreign_start_station_id,foreign_end_station_id,bike_id,user_type,birth_year,gender
0,362,2016-01-01 00:02:52,2016-01-01 00:08:54,3186,3209,24647,Subscriber,1964,2
1,200,2016-01-01 00:18:22,2016-01-01 00:21:42,3186,3213,24605,Subscriber,1962,1
2,202,2016-01-01 00:18:25,2016-01-01 00:21:47,3186,3213,24689,Subscriber,1962,2
3,248,2016-01-01 00:23:13,2016-01-01 00:27:21,3209,3203,24693,Subscriber,1984,1
4,903,2016-01-01 01:03:20,2016-01-01 01:18:24,3195,3210,24573,Customer,0,0

In [21]:
df_start_station.head(5)

,start_station_id,start_station_name,start_station_latitude,start_station_longitude
0,3186,Grove St PATH,40.719586,-74.043117
1,3209,Brunswick St,40.724176,-74.050656
2,3195,Sip Ave,40.730743,-74.063784
3,3211,Newark Ave,40.721525,-74.046305
4,3187,Warren St,40.721124,-74.038051

In [30]:
df_end_station.head(5)

,end_station_id,end_station_name,end_station_latitude,end_station_longitude
0,3209,Brunswick St,40.724176,-74.050656
1,3213,Van Vorst Park,40.718489,-74.047727
2,3203,Hamilton Park,40.727596,-74.044247
3,3210,Pershing Field,40.742677,-74.051789
4,3214,Essex Light Rail,40.712774,-74.036486

In [22]:
# Drop empty columns

df_na = df_na.drop(columns=['pgtm', 'tsun'])

In [23]:
# Filling nan values and chnging data types

df_na['wdf5'] = df_na['wdf5'].fillna(df_na['wdf5'].median())
df_na['wdf5'] = df_na['wdf5'].astype('Int32')

df_na['wsf5'] = df_na['wsf5'].fillna(df_na['wsf5'].median())

In [24]:
# Spliting tables

df_na_weather = df_na.drop(columns=['name'])
df_na_station = df_na[['station', 'name']].drop_duplicates()

In [25]:
df_na_station

       station                                         name
0  USW00014734  NEWARK LIBERTY INTERNATIONAL AIRPORT, NJ US

In [26]:
df_na_weather

,station,date,awnd,prcp,snow,snwd,tavg,tmax,tmin,wdf2,wdf5,wsf2,wsf5
0,USW00014734,2016-01-01,12.75,0.00,0.0,0.0,41,43,34,270,280,25.9,35.1
1,USW00014734,2016-01-02,9.40,0.00,0.0,0.0,36,42,30,260,260,21.0,25.1
2,USW00014734,2016-01-03,10.29,0.00,0.0,0.0,37,47,28,270,250,23.9,30.0
3,USW00014734,2016-01-04,17.22,0.00,0.0,0.0,32,35,14,330,330,25.9,33.1
4,USW00014734,2016-01-05,9.84,0.00,0.0,0.0,19,31,10,360,350,25.1,31.1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
361,USW00014734,2016-12-27,13.65,0.01,0.0,0.0,53,62,40,270,270,29.1,38.0
362,USW00014734,2016-12-28,8.28,0.00,0.0,0.0,41,43,31,330,330,19.9,25.1
363,USW00014734,2016-12-29,8.05,0.36,0.0,0.0,38,45,31,170,150,18.1,25.1
364,USW00014734,2016-12-30,14.99,0.00,0.0,0.0,37,42,32,270,270,25.9,33.1
365,USW00014734,2016-12-31,12.30,0.00,0.0,0.0,35,44,29,200,220,21.9,28.0

## Schema Summary

- Raw data was splitted into relational tables 
- All tables was reviewed, data-types updated, work with NANs was performed end etc 
- Primary key, foreign key relationships established (../bike_rental_data/database_schema/)

## Create the Database

In [27]:
#|export

# Creating connection to database
engine = sql.create_engine('postgresql://postgres:8231@localhost:5432/bike_rental_data_management')

In [29]:
#|export

# Writing jc_ride table to database
df_jc_ride.to_sql('jc_ride', engine)
df_start_station.to_sql('start_station', engine)
df_end_station.to_sql('end_station', engine)

# Writing na table to database
df_na_station.to_sql('na_station', engine)
df_na_weather.to_sql('na_weather', engine)

366

In [ ]:
#|default_exp bike_rental_pipeline
#| hide
import IPython
import nbdev; nbdev.nbdev_export(IPython.extract_module_locals()[1]["__vsc_ipynb_file__"])